app/controllers/sessions_controller.rb

  def create
    user = User.find_by name: params[:session][:name].downcase
---
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "sang1@gmail.com"], ["LIMIT", 1]]