app/controllers/users_controller.rb

  def create
    @user = User.new user_params
    if @user.save
---
INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "sang@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2022-01-09 14:42:31.003710"], ["updated_at", "2022-01-09 14:42:31.003710"]]

  def show
    @user = User.find_by id: params[:id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]